Tekla.Structures.Analysis.AnalysisEdge
The AnalysisEdge class contains information related to analysis edges.

Tekla.Structures.Analysis.AnalysisEdge._SplitPositions
The split positions of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge._Connectivity
The connectivity of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge._Radius
The radius of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge.#ctor(Tekla.Structures.Analysis.AnalysisObject.AnalysisObjectEnum)
Creates a new instance of the AnalysisEdge class.
ObjectType: The type of the analysis object.

Tekla.Structures.Analysis.AnalysisEdge.SplitPositions
The split positions of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge.Connectivity
The connectivity of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge.Radius
The radius of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge.Modify
Modifies an analysis edge.
The AnalysisModelName has to be set.

Tekla.Structures.Analysis.AnalysisEdge.Select
Selects an analysis edge.

Tekla.Structures.Analysis.AnalysisEdge.GetSplitPositions
Gets the split positions of the analysis edge.
Returns: The split positions of the analysis edge.

Tekla.Structures.Analysis.AnalysisEdge.AddSplit(Tekla.Structures.Analysis.AnalysisPosition)
Adds a split position to the analysis edge.
AnalysisPosition: The split position to be added.

Tekla.Structures.Analysis.AnalysisEdge.CopyData(Tekla.Structures.Analysis.AnalysisEdge)
Copies data from another analysis edge.
Analysisedge: The analysis edge to copy data from.

Tekla.Structures.Analysis.AnalysisEdge.ModifyInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisEdge.SelectInstance
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisEdge.CreateSplitPositionEnumerator
Create split position enumerator.

Tekla.Structures.Analysis.AnalysisEdge.CollectData
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.AnalysisEdge.CopyDataFromInstance(Tekla.Structures.Analysis.AnalysisEdge)
Copies data from another edge

Tekla.Structures.Analysis.AnalysisEdge.AddSplitPosition(Tekla.Structures.Analysis.AnalysisPosition)
Adds split position to edge.